Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: After that, calling :cfunc:`PyType_Ready` and adding the type object to the module is the same as with the basic :class:`Noddy` examples.
pl: Po tym, wezwanie :cfunc:`PyType_Ready` i dodanie przedmiotu typu do modułu będzie tym samym jak w podstawowych przykładach uogólnienia :class:`Noddy`.

source: Type Methods
pl: Sposoby postępowania typu

source: This section aims to give a quick fly-by on the various type methods you can implement and what they do.
pl: Ten rozdział ma na celu szybko oblecieć różne sposoby postępowania typów które możesz wypełnić i omówić co one robią.

source: Here is the definition of :ctype:`PyTypeObject`, with some fields only used in debug builds omitted:
pl: Tu jest definicja :ctype:`PyTypeObject`, z pewnymi polami tylko używanymi w budowach odpluskwiania zazwyczaj pomijanych:

source: typedef struct _typeobject { PyObject_VAR_HEAD char *tp_name; /* For printing, in format "<module>.<name>" */ int tp_basicsize, tp_itemsize; /* For allocation */ /* Methods to implement standard operations */ destructor tp_dealloc; printfunc tp_print; getattrfunc tp_getattr; setattrfunc tp_setattr; void *tp_reserved; reprfunc tp_repr; /* Method suites for standard classes */ PyNumberMethods *tp_as_number; PySequenceMethods *tp_as_sequence; PyMappingMethods *tp_as_mapping; /* More standard operations (here for binary compatibility) */ hashfunc tp_hash; ternaryfunc tp_call; reprfunc tp_str; getattrofunc tp_getattro; setattrofunc tp_setattro; /* Functions to access object as input/output buffer */ PyBufferProcs *tp_as_buffer; /* Flags to define presence of optional/expanded features */ long tp_flags; char *tp_doc; /* Documentation string */ /* call function for all accessible objects */ traverseproc tp_traverse; /* delete references to contained objects */ inquiry tp_clear; /* rich comparisons */ richcmpfunc tp_richcompare; /* weak reference enabler */ long tp_weaklistoffset; /* Iterators */ getiterfunc tp_iter; iternextfunc tp_iternext; /* Attribute descriptor and subclassing stuff */ struct PyMethodDef *tp_methods; struct PyMemberDef *tp_members; struct PyGetSetDef *tp_getset; struct _typeobject *tp_base; PyObject *tp_dict; descrgetfunc tp_descr_get; descrsetfunc tp_descr_set; long tp_dictoffset; initproc tp_init; allocfunc tp_alloc; newfunc tp_new; freefunc tp_free; /* Low-level free-memory routine */ inquiry tp_is_gc; /* For PyObject_IS_GC */ PyObject *tp_bases; PyObject *tp_mro; /* method resolution order */ PyObject *tp_cache; PyObject *tp_subclasses; PyObject *tp_weaklist; } PyTypeObject;
pl: typedef struct _typeobject { PyObject_VAR_HEAD char *tp_name; /* Dla wypisywania, w formacie "<moduł>.<nazwa>" */ int tp_basicsize, tp_itemsize; /* Dla lokowania w pamięci */ /* Sposoby postępowania aby wypełnić standardowe operacje */ destructor tp_dealloc; printfunc tp_print; getattrfunc tp_getattr; setattrfunc tp_setattr; void *tp_reserved; reprfunc tp_repr; /* Zestawy sposobów postępowania dla uogólnień standardowych */ PyNumberMethods *tp_as_number; PySequenceMethods *tp_as_sequence; PyMappingMethods *tp_as_mapping; /* Więcej standardowych operacji (tutaj tylko dla binarnej zgodności) */ hashfunc tp_hash; ternaryfunc tp_call; reprfunc tp_str; getattrofunc tp_getattro; setattrofunc tp_setattro; /* Zadania aby uzyskać przedmiot dostępu jako wejściowo/wyjściową przestrzenią wymiany */ PyBufferProcs *tp_as_buffer; /* Flagi aby zdefiniować obecność opcjonalnych/rozszerzonych właściwości */ long tp_flags; char *tp_doc; /* Ciągi dokumentacji */ /* wywołanie zadania dla wszystkich dostępnych przedmiotów */ traverseproc tp_traverse; /* skasować odniesienia do zawartych tam przedmiotów */ inquiry tp_clear; /* bogate porównania */ richcmpfunc tp_richcompare; /* umożliwianie słabych odniesień */ long tp_weaklistoffset; /* iteratory */ getiterfunc tp_iter; iternextfunc tp_iternext; /* deskryptor właściwości i sprawy dziedziczenia */ struct PyMethodDef *tp_methods; struct PyMemberDef *tp_members; struct PyGetSetDef *tp_getset; struct _typeobject *tp_base; PyObject *tp_dict; descrgetfunc tp_descr_get; descrsetfunc tp_descr_set; long tp_dictoffset; initproc tp_init; allocfunc tp_alloc; newfunc tp_new; freefunc tp_free; /* Nisko-poziomowe zadanie zwalniające pamięć */ inquiry tp_is_gc; /* Dla PyObject_IS_GC */ PyObject *tp_bases; PyObject *tp_mro; /* kolejność rozwiązywania sposobów postępowania */ PyObject *tp_cache; PyObject *tp_subclasses; PyObject *tp_weaklist; } PyTypeObject;

source: Now that's a *lot* of methods. Don't worry too much though - if you have a type you want to define, the chances are very good that you will only implement a handful of these.
pl: Cóż, to jest *dużo* sposobów postępowania. Nie martw się za bardzo jednak - jeśli masz typ który chcesz zdefiniować, szanse są bardzo dobre, że będziesz wypełniał tylko kilka z nich.

source: As you probably expect by now, we're going to go over this and give more information about the various handlers. We won't go in the order they are defined in the structure, because there is a lot of historical baggage that impacts the ordering of the fields; be sure your type initialization keeps the fields in the right order! It's often easiest to find an example that includes all the fields you need (even if they're initialized to ``0``) and then change the values to suit your new type. ::
pl: Jak już pewnie spodziewasz się teraz, przejdziemy się ponad tym i podamy więcej informacji o różnych obsługach. Nie będziemy wdawać się w kolejność w której są one zdefiniowane w strukturze ponieważ jest mnóstwo historycznego bagażu który wpływa na poszeregowanie pól; upewnij się że twoje inicjowanie typu utrzymuje pola we właściwym porządku! Czasem najłatwiej jest znaleźć przykład, który zawiera wszystkie pola których potrzebujesz (nawet jeśli są one zainicjowane ``0``) i potem zmienić wartości aby odpowiadały twojemu nowemu typowi. ::

source: char *tp_name; /* For printing */
pl: char *tp_name; /* Dla wypisywania */

source: The name of the type - as mentioned in the last section, this will appear in various places, almost entirely for diagnostic purposes. Try to choose something that will be helpful in such a situation! ::
pl: Nazwa typu - jak wymieniono w poprzednim rozdziale, to będzie pojawiało się w różnych miejscach, prawie całkowicie dla celów diagnostycznych. Spróbuj wybrać coś co będzie pomocne w takiej sytuacji! ::

source: int tp_basicsize, tp_itemsize; /* For allocation */
pl: int tp_basicsize, tp_itemsize; /* Dla umieszczania w pamięci */

source: These fields tell the runtime how much memory to allocate when new objects of this type are created. Python has some built-in support for variable length structures (think: strings, lists) which is where the :attr:`tp_itemsize` field comes in. This will be dealt with later. ::
pl: Te pola mówią dla programu uruchomionego jak dużo pamięci przeznaczyć kiedy nowe przedmioty tego typu są tworzone. Język pytonowski ma pewne wbudowane wsparcie dla różnej długości struktur (mam na myśli: ciągi znaków, listy) które jest tam, gdzie pole :attr:`tp_itemsize` pojawia się. Tym zajmiemy się później. ::

source: Here you can put a string (or its address) that you want returned when the Python script references ``obj.__doc__`` to retrieve the doc string.
pl: Tu możesz wstawić ciąg znaków (lub jego adres) który chcesz zwrócić gdy skrypt języka pytonowskiego odnosi się do ``obj.__doc__`` aby otrzymać ciąg znaków dokumentacji.

source: Now we come to the basic type methods---the ones most extension types will implement.
pl: A teraz dochodzimy do podstawowego typu sposobów postępowania---te których większość typów rozszerzeń będzie wypełniać.

source: Finalization and De-allocation
pl: Finalizowanie i Zwalnianie-miejsca

source: This function is called when the reference count of the instance of your type is reduced to zero and the Python interpreter wants to reclaim it. If your type has memory to free or other clean-up to perform, put it here. The object itself needs to be freed here as well. Here is an example of this function::
pl: To zadanie jest wywoływane gdy liczba odniesień przykładu twojego typu jest zredukowana do zera i program interpretujący polecenia języka pytonowskiego chce przejąć je na powrót. Jeśli twój typ ma pamięć do zwolnienia lub inne czyszczenie do wykonania, wstaw je tutaj. Przedmiot sam potrzebuje być zwolniony także tutaj. Tu jest przykład tego zadania::

source: One important requirement of the deallocator function is that it leaves any pending exceptions alone. This is important since deallocators are frequently called as the interpreter unwinds the Python stack; when the stack is unwound due to an exception (rather than normal returns), nothing is done to protect the deallocators from seeing that an exception has already been set. Any actions which a deallocator performs which may cause additional Python code to be executed may detect that an exception has been set. This can lead to misleading errors from the interpreter. The proper way to protect against this is to save a pending exception before performing the unsafe action, and restoring it when done. This can be done using the :cfunc:`PyErr_Fetch` and :cfunc:`PyErr_Restore` functions::
pl: Jednym istotnym wymaganiem zadania zwalniania pamięci jest to, że pozostawia jakiekolwiek oczekujące wyjątki same sobie. To jest istotne odkąd zadania zwalniające pamięć są często wywoływane gdy program interpretujący odwija stertę programu interpretującego polecenia języka pytonowskiego; gdy sterta jest odwinięta z powodu wyjątku (zamiast normalnych powrotów), nic nie jest robione aby bronić zadania uwalniające miejsca w pamięci przed zobaczeniem że wyjątek już został zgłoszony. Jakiekolwiek akcje które zadanie zwalniania pamięci wykonają które mogą spowodować wykonanie dodatkowego kodu języka pytonowskiego mogą wykryć że wyjątek został ustawiony. To może prowadzić do wprowadzających zamieszanie błędów ze strony programu interpretującego. Właściwą drogą aby bronić się przeciwko temu jest zapamiętać oczekujący wyjątek przed wykonaniem niebezpiecznego działania, a potem odtworzyć je gdy się skończy to ostatnie. To może być wykonywane używając zadań :cfunc:`PyErr_Fetch` i :cfunc:`PyErr_Restore`::

source: Object Presentation
pl: Prezentacja Przedmiotów

source: In Python, there are two ways to generate a textual representation of an object: the :func:`repr` function, and the :func:`str` function. (The :func:`print` function just calls :func:`str`.) These handlers are both optional.
pl: w języku pytonowskim, istnieją dwa sposoby aby wygenerować tekstową reprezentację przedmiotu: zadanie :func:`repr`, i zadanie :func:`str`. (Zadanie :func:`print` po prostu wywołuje zadanie :func:`str`.) Ta zadania obsługi są oba opcjonalne.

source: The :attr:`tp_repr` handler should return a string object containing a representation of the instance for which it is called. Here is a simple example::
pl: Sposób postępowania obsługi :attr:`tp_repr` powinien zwrócić przedmiot ciągu znaków zawierający reprezentację przykładu dla którego został wywołany. Tu jest prosty przykład::

source: If no :attr:`tp_repr` handler is specified, the interpreter will supply a representation that uses the type's :attr:`tp_name` and a uniquely-identifying value for the object.
pl: Jeśli żadna :attr:`tp_repr` obsługa nie jest określona, program interpretujący polecenia języka pytonowskiego dostarczy reprezentację, która używa :attr:`tp_name` należącego do typu i jednoznacznie-identyfikującą wartość dla przedmiotu.

source: The :attr:`tp_str` handler is to :func:`str` what the :attr:`tp_repr` handler described above is to :func:`repr`; that is, it is called when Python code calls :func:`str` on an instance of your object. Its implementation is very similar to the :attr:`tp_repr` function, but the resulting string is intended for human consumption. If :attr:`tp_str` is not specified, the :attr:`tp_repr` handler is used instead.
pl: Obsługa :attr:`tp_str` jest dla zadania :func:`str` tym, czym obsługa :attr:`tp_repr` opisywana powyżej dla zadania :func:`repr`; to jest, jest wzywana gdy kod języka pytonowskiego wywołuje :func:`str` na przykładzie twojego przedmiotu. Jego wypełnienie jest bardzo podobne do zadania :attr:`tp_repr`, ale wynikający ciąg znaków jest przeznaczony do przeczytania dla człowieka. Jeśli :attr:`tp_str` jest nieokreślona, obsługa :attr:`tp_repr` jest używana zamiast tego.

source: Here is a simple example::
pl: Tu jest prosty przykład::

source: Attribute Management
pl: Zarządzanie własnościami

source: For every object which can support attributes, the corresponding type must provide the functions that control how the attributes are resolved. There needs to be a function which can retrieve attributes (if any are defined), and another to set attributes (if setting attributes is allowed). Removing an attribute is a special case, for which the new value passed to the handler is *NULL*.
pl: Dla każdego przedmiotu który może wspierać własności, odpowiadający typ musi dostarczać zadań które kontrolują jak właściwości są rozwiązywane. Potrzebne jest zadanie, które może przechwytywać właściwości (jeśli jakiekolwiek są określone), i następny, aby ustawiać właściwości (jeśli ustawianie właściwości jest dozwolone). Usunięcie właściwości jest szczególnym przypadkiem, dla którego nowa wartość przekazywana do obsługi jest *NULL*.

source: Python supports two pairs of attribute handlers; a type that supports attributes only needs to implement the functions for one pair. The difference is that one pair takes the name of the attribute as a :ctype:`char\*`, while the other accepts a :ctype:`PyObject\*`. Each type can use whichever pair makes more sense for the implementation's convenience. ::
pl: Język pytonowski wspiera dwie pary zadań obsługujących właściwości; typ który wspiera właściwości potrzebuje tylko wypełnić zadania dla jednej pary. Różnica polega na tym, że jedna para przyjmuje nazwę właściwości jako :ctype:`char\*`, podczas gdy inne akceptują :ctype:`PyObject\*`. Każdy typ może użyć którejkolwiek z par, która ma więcej sensu dla możliwego wypełnienia. ::

source: getattrfunc tp_getattr; /* char * version */ setattrfunc tp_setattr; /* ... */ getattrofunc tp_getattro; /* PyObject * version */ setattrofunc tp_setattro;
pl: getattrfunc tp_getattr; /* wersja char * */ setattrfunc tp_setattr; /* ... */ getattrofunc tp_getattro; /* wersja PyObject * */ setattrofunc tp_setattro;

source: If accessing attributes of an object is always a simple operation (this will be explained shortly), there are generic implementations which can be used to provide the :ctype:`PyObject\*` version of the attribute management functions. The actual need for type-specific attribute handlers almost completely disappeared starting with Python 2.2, though there are many examples which have not been updated to use some of the new generic mechanism that is available.
pl: Jeśli dostawanie dostępu do własności przedmiotu jest zawsze prostą operacją (to zostanie wyjaśnione niedługo), to istnieją proste wypełnienia, które mogą być użyte aby dostarczyć wersję :ctype:`PyObject\*` zadań zarządzających własnościami. Właściwa potrzeba dla szczególnego-dla-typu zadania obsługi własności prawie przestała istnieć poczynając od języka pytonowskiego w wersji 2.2, chociaż istnieje wiele przykładów, które nie zostały uaktualnione do używania nowego zastępczego mechanizmu chociaż jest on dostępny.

source: Generic Attribute Management
pl: Zastępcze zarządzanie właściwościami

source: Most extension types only use *simple* attributes. So, what makes the attributes simple? There are only a couple of conditions that must be met:
pl: Większość typów rozszerzeń używa tylko *prostych* właściwości. Więc, co sprawia że właściwości są proste? Istnieje tylko kilka warunków które należy spełnić:

source: The name of the attributes must be known when :cfunc:`PyType_Ready` is called.
pl: Nazwa właściwości musi być znana gdy zadanie :cfunc:`PyType_Ready` jest wzywane.

source: No special processing is needed to record that an attribute was looked up or set, nor do actions need to be taken based on the value.
pl: Żadne szczególne przetwarzanie nie jest potrzebne aby zarejestrować, że właściwość została pobrana lub ustawiona, ani też działania nie muszą być podejmowane w oparciu o wartość.

source: Note that this list does not place any restrictions on the values of the attributes, when the values are computed, or how relevant data is stored.
pl: Zauważ że ta lista nie umieszcza żadnych ograniczeń na wartościach właściwości, gdy wartości są obliczane, lub jak istotne dane są przechowywane.

source: When :cfunc:`PyType_Ready` is called, it uses three tables referenced by the type object to create :term:`descriptor`\s which are placed in the dictionary of the type object. Each descriptor controls access to one attribute of the instance object. Each of the tables is optional; if all three are *NULL*, instances of the type will only have attributes that are inherited from their base type, and should leave the :attr:`tp_getattro` and :attr:`tp_setattro` fields *NULL* as well, allowing the base type to handle attributes.
pl: Gdy zadanie :cfunc:`PyType_Ready` jest wywoływane, używa trzech tabeli określonych przez przedmiot typu aby tworzyć :term:`element opisujący`\e które są umieszczane w słowniku typu przedmiotu. Każdy element opisujący kontroluje dostęp do jednej właściwości przykładu przedmiotu. Każda z tabel jest opcjonalna; jeśli wszystkie trzy są *NULL*, przykłady typu będą miały właściwości, które są dziedziczone z ich typu bazowego, i powinny pozostawić pola :attr:`tp_getattro` i :attr:`tp_setattro` na *NULL* zarówno, pozwalając aby typ bazowy obsługiwał właściwości.

source: The tables are declared as three fields of the type object::
pl: Tabele są zadeklarowane jako trzy pola przedmiotu typu::

source: If :attr:`tp_methods` is not *NULL*, it must refer to an array of :ctype:`PyMethodDef` structures. Each entry in the table is an instance of this structure::
pl: Jeśli :attr:`tp_methods` nie jest *NULL*, wtedy musi odnosić się do tabeli struktur :ctype:`PyMethodDef`. Każdy wpis w tabeli jest przykładem tej struktury::

source: typedef struct PyMethodDef { char *ml_name; /* method name */ PyCFunction ml_meth; /* implementation function */ int ml_flags; /* flags */ char *ml_doc; /* docstring */ } PyMethodDef;
pl: typedef struct PyMethodDef { char *ml_name; /* nazwa sposobu postępowania */ PyCFunction ml_meth; /* zadanie wypełnienia */ int ml_flags; /* flagi */ char *ml_doc; /* ciąg dokumentacji */ } PyMethodDef;

source: One entry should be defined for each method provided by the type; no entries are needed for methods inherited from a base type. One additional entry is needed at the end; it is a sentinel that marks the end of the array. The :attr:`ml_name` field of the sentinel must be *NULL*.
pl: Jeden wpis powinien być określony dla każdego sposobu postępowania dostarczonego przez typ; żadne wpisy nie są potrzebne dla sposobów postępowania odziedziczonych z typu bazowego. Jeden dodatkowy wpis jest konieczny na końcu; jest to ochroniarz który oznacza koniec tabeli. Pole :attr:`ml_name` ochroniarza musi być *NULL*.

source: XXX Need to refer to some unified discussion of the structure fields, shared with the next section.
pl: XXX Potrzeba odniesienia do pewnych systematycznych dyskusji pól struktury, dzielonych z następną sekcją.

source: The second table is used to define attributes which map directly to data stored in the instance. A variety of primitive C types are supported, and access may be read-only or read-write. The structures in the table are defined as::
pl: Druga tabela jest używana aby określać właściwości które odnoszą się bezpośrednio do danych przechowywanych w przykładzie. Różnorodne podstawowe typy C są wspierane, i dostęp może być albo tylko-do-odczytu lub odczyt-i-zapis. Struktury w tabeli są określone jako::

source: For each entry in the table, a :term:`descriptor` will be constructed and added to the type which will be able to extract a value from the instance structure. The :attr:`type` field should contain one of the type codes defined in the :file:`structmember.h` header; the value will be used to determine how to convert Python values to and from C values. The :attr:`flags` field is used to store flags which control how the attribute can be accessed.
pl: Dla każdego wpisu w tabeli, zostanie skonstruowany :term:`element opisujący` - z ang. - :term:`descriptor` i dodany do typu, który będzie mógł wydobyć wartość ze struktury przykładu. Pole :attr:`type` powinno zawierać jeden z kodów typu określonych w nagłówku :file:`structmember.h`; wartość będzie użyta do określenia jak zamienić wartości języka pytonowskiego z i na wartości C. Pole :attr:`flags` jest używane do przechowywania flag które kontrolują, jak można uzyskać dostęp do właściwości.

source: XXX Need to move some of this to a shared section!
pl: XXX Potrzeba przełożyć część z tego do współdzielonego rozdziału!

source: The following flag constants are defined in :file:`structmember.h`; they may be combined using bitwise-OR.
pl: Następujące stałe flag są określone w pliku :file:`structmember.h`; mogą złączone przy użyciu bitowego-LUB.

source: Constant
pl: Stała

source: Meaning
pl: Znaczenie

source: Never writable.
pl: Nigdy nie do wpisywania.

source: Not readable in restricted mode.
pl: Nie do czytania w trybie z ograniczeniami.

source: Not writable in restricted mode.
pl: Nie do pisania w trybie z ograniczeniami.

source: Not readable or writable in restricted mode.
pl: Nie do czytania ani pisania w trybie z ograniczeniami.

source: An interesting advantage of using the :attr:`tp_members` table to build descriptors that are used at runtime is that any attribute defined this way can have an associated doc string simply by providing the text in the table. An application can use the introspection API to retrieve the descriptor from the class object, and get the doc string using its :attr:`__doc__` attribute.
pl: Interesującą zaletą używania tabeli :attr:`tp_members` do budowania elementów opisujących ( - z ang. - descriptors), które są używane w czasie wykonania programu jest to, że jakiekolwiek właściwości określone w ten sposób mogą mieć dołączony ciąg znaków dokumentacji po prostu przez dostarczenie tekstu w tabeli. Aplikacja może używać sprzęgu wglądu wewnętrznego aby odbierać element opisujący z przedmiotu uogólnienia, i pobierać ciąg znaków używając jego właściwości :attr:`__doc__`.

source: As with the :attr:`tp_methods` table, a sentinel entry with a :attr:`name` value of *NULL* is required.
pl: Tak, jak w tabeli :attr:`tp_methods`, wpis ochroniarza z właściwością :attr:`name` o wartości *NULL* jest wymagany.

source: Type-specific Attribute Management
pl: Szczególne-dla-typu-przedmiotu zarządzanie właściwościami

source: For simplicity, only the :ctype:`char\*` version will be demonstrated here; the type of the name parameter is the only difference between the :ctype:`char\*` and :ctype:`PyObject\*` flavors of the interface. This example effectively does the same thing as the generic example above, but does not use the generic support added in Python 2.2. It explains how the handler functions are called, so that if you do need to extend their functionality, you'll understand what needs to be done.
pl: Dla prostoty, tylko wersja :ctype:`char\*` będzie zademonstrowana tutaj; typ parametru nazwy jest jedyną różnicą pomiędzy odcieniami sprzęgu :ctype:`char\*` i :ctype:`PyObject\*`. Ten przykład efektywnie czyni tę samą rzecz, jak zastępcze przykłady powyżej, ale nie używa zastępczego wsparcia dodanego w wersji języka pytonowskiego 2.2. To wyjaśnia, jak zadania obsługi są wywoływane, tak że jeśli potrzebujesz rozszerzyć ich możliwości, będziesz rozumiał co trzeba zrobić.
